Revit.Elements.DetailCurve
Revit Detail Curve

Revit.Elements.DetailCurve.#ctor(Autodesk.Revit.DB.DetailCurve)
Construct a detail curve from an existing element
element: Revit element

Revit.Elements.DetailCurve.#ctor(Autodesk.Revit.DB.View,Autodesk.Revit.DB.Curve)
Construct a detail curve by curve
view: View
curve: Curve

Revit.Elements.DetailCurve.InitElement(Autodesk.Revit.DB.DetailCurve)
Initialize Detail Curve element
curve:

Revit.Elements.DetailCurve.Init(Autodesk.Revit.DB.View,Autodesk.Revit.DB.Curve)
Init a new detail curve from curve
view:
curve:

Revit.Elements.DetailCurve.ByCurve(Revit.Elements.Views.View,Autodesk.DesignScript.Geometry.Curve)
Construct a Revit DetailCurve element from a curve
view: View to place the detail curve on
curve: Curve to create detailcurve from
Returns:

Revit.Elements.DetailCurve.Curve
Get Geometry Curve

Revit.Elements.DetailCurve.SetCurve(Autodesk.DesignScript.Geometry.Curve)
Set Geometry Curve